; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared1 - mode
	spectrograph2 - mode
	infrared0 - mode
	thermograph3 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 170)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 164)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star0)
	(supports instrument5 thermograph3)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared0)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 167)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph3)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 thermograph3)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon4)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 159)
	(= (data Planet3 infrared1) 201)
	(= (data Phenomenon4 infrared1) 24)
	(= (data Phenomenon5 infrared1) 98)
	(= (data Star6 infrared1) 164)
	(= (data Planet3 spectrograph2) 118)
	(= (data Phenomenon4 spectrograph2) 212)
	(= (data Phenomenon5 spectrograph2) 41)
	(= (data Star6 spectrograph2) 226)
	(= (data Planet3 infrared0) 300)
	(= (data Phenomenon4 infrared0) 225)
	(= (data Phenomenon5 infrared0) 293)
	(= (data Star6 infrared0) 57)
	(= (data Planet3 thermograph3) 61)
	(= (data Phenomenon4 thermograph3) 7)
	(= (data Phenomenon5 thermograph3) 76)
	(= (data Star6 thermograph3) 15)
	(= (slew_time GroundStation1 Star0) 23.45)
	(= (slew_time Star0 GroundStation1) 23.45)
	(= (slew_time GroundStation2 Star0) 12)
	(= (slew_time Star0 GroundStation2) 12)
	(= (slew_time GroundStation2 GroundStation1) 37.76)
	(= (slew_time GroundStation1 GroundStation2) 37.76)
	(= (slew_time Planet3 Star0) 10.16)
	(= (slew_time Star0 Planet3) 10.16)
	(= (slew_time Planet3 GroundStation1) 20.23)
	(= (slew_time GroundStation1 Planet3) 20.23)
	(= (slew_time Planet3 GroundStation2) 18.53)
	(= (slew_time GroundStation2 Planet3) 18.53)
	(= (slew_time Phenomenon4 Star0) 2.319)
	(= (slew_time Star0 Phenomenon4) 2.319)
	(= (slew_time Phenomenon4 GroundStation1) 6.348)
	(= (slew_time GroundStation1 Phenomenon4) 6.348)
	(= (slew_time Phenomenon4 GroundStation2) 12.66)
	(= (slew_time GroundStation2 Phenomenon4) 12.66)
	(= (slew_time Phenomenon4 Planet3) 78.65)
	(= (slew_time Planet3 Phenomenon4) 78.65)
	(= (slew_time Phenomenon5 Star0) 11.03)
	(= (slew_time Star0 Phenomenon5) 11.03)
	(= (slew_time Phenomenon5 GroundStation1) 3.037)
	(= (slew_time GroundStation1 Phenomenon5) 3.037)
	(= (slew_time Phenomenon5 GroundStation2) 55.81)
	(= (slew_time GroundStation2 Phenomenon5) 55.81)
	(= (slew_time Phenomenon5 Planet3) 48.15)
	(= (slew_time Planet3 Phenomenon5) 48.15)
	(= (slew_time Phenomenon5 Phenomenon4) 28.63)
	(= (slew_time Phenomenon4 Phenomenon5) 28.63)
	(= (slew_time Star6 Star0) 25.11)
	(= (slew_time Star0 Star6) 25.11)
	(= (slew_time Star6 GroundStation1) 8.738)
	(= (slew_time GroundStation1 Star6) 8.738)
	(= (slew_time Star6 GroundStation2) 31.7)
	(= (slew_time GroundStation2 Star6) 31.7)
	(= (slew_time Star6 Planet3) 41.04)
	(= (slew_time Planet3 Star6) 41.04)
	(= (slew_time Star6 Phenomenon4) 3.565)
	(= (slew_time Phenomenon4 Star6) 3.565)
	(= (slew_time Star6 Phenomenon5) 93.23)
	(= (slew_time Phenomenon5 Star6) 93.23)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite3 Phenomenon5)
	(have_image Planet3 infrared0)
	(have_image Phenomenon5 infrared1)
	(have_image Star6 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 phenomenon5 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 phenomenon5)
   changed: (fuel satellite3) from 159 to 130.37, (fuel-used) from 0 to 28.63
   goals met: 2 of 5
2. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 167 to 164.681, (fuel-used) from 28.63 to 30.949
   goals met: 2 of 5
3. (turn_to satellite2 star6 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star6)
   changed: (fuel satellite2) from 164.681 to 161.116, (fuel-used) from 30.949 to 34.514
   goals met: 2 of 5
4. (turn_to satellite2 phenomenon4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 161.116 to 157.551, (fuel-used) from 34.514 to 38.079
   goals met: 2 of 5
5. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 5
6. (turn_to satellite2 star6 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star6)
   changed: (fuel satellite2) from 157.551 to 153.986, (fuel-used) from 38.079 to 41.644
   goals met: 2 of 5
7. (turn_to satellite1 star0 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 164 to 152.97, (fuel-used) from 41.644 to 52.674
   goals met: 2 of 5
8. (turn_to satellite2 phenomenon4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 153.986 to 150.421, (fuel-used) from 52.674 to 56.239
   goals met: 2 of 5
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 5
10. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 2 of 5
11. (turn_to satellite1 planet3 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 152.97 to 142.81, (fuel-used) from 56.239 to 66.399
   goals met: 2 of 5
12. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 150.421 to 148.102, (fuel-used) from 66.399 to 68.718
   goals met: 2 of 5
13. (calibrate satellite2 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 2 of 5
14. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 148.102 to 145.783, (fuel-used) from 68.718 to 71.037
   goals met: 2 of 5
15. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 2 of 5
16. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 145.783 to 143.464, (fuel-used) from 71.037 to 73.356
   goals met: 2 of 5
17. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 143.464 to 141.145, (fuel-used) from 73.356 to 75.675
   goals met: 2 of 5
18. (take_image satellite1 planet3 instrument3 infrared0)
   added: (have_image planet3 infrared0)
   changed: (data_capacity satellite1) from 1000 to 700, (data-stored) from 0 to 300
   goals met: 3 of 5
19. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 141.145 to 138.826, (fuel-used) from 75.675 to 77.994
   goals met: 3 of 5
20. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 138.826 to 136.507, (fuel-used) from 77.994 to 80.313
   goals met: 3 of 5
21. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 5
22. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 136.507 to 134.188, (fuel-used) from 80.313 to 82.632
   goals met: 3 of 5
23. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 134.188 to 131.869, (fuel-used) from 82.632 to 84.951
   goals met: 3 of 5
24. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 131.869 to 129.55, (fuel-used) from 84.951 to 87.27
   goals met: 3 of 5
25. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 129.55 to 127.231, (fuel-used) from 87.27 to 89.589
   goals met: 3 of 5
26. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 127.231 to 124.912, (fuel-used) from 89.589 to 91.908
   goals met: 3 of 5
27. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 124.912 to 122.593, (fuel-used) from 91.908 to 94.227
   goals met: 3 of 5
28. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 122.593 to 120.274, (fuel-used) from 94.227 to 96.546
   goals met: 3 of 5
29. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 120.274 to 117.955, (fuel-used) from 96.546 to 98.865
   goals met: 3 of 5
30. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 3 of 5
31. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 117.955 to 115.636, (fuel-used) from 98.865 to 101.184
   goals met: 3 of 5
32. (switch_on instrument6 satellite2)
   deleted: (calibrated instrument6) (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 3 of 5
33. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 115.636 to 113.317, (fuel-used) from 101.184 to 103.503
   goals met: 3 of 5
34. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 113.317 to 110.998, (fuel-used) from 103.503 to 105.822
   goals met: 3 of 5
35. (calibrate satellite2 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 3 of 5
36. (turn_to satellite2 star6 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star6)
   changed: (fuel satellite2) from 110.998 to 85.888, (fuel-used) from 105.822 to 130.932
   goals met: 3 of 5
37. (take_image satellite2 star6 instrument6 infrared0)
   added: (have_image star6 infrared0)
   changed: (data_capacity satellite2) from 1000 to 943, (data-stored) from 300 to 357
   goals met: 4 of 5
38. (turn_to satellite2 groundstation1 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 85.888 to 77.15, (fuel-used) from 130.932 to 139.67
   goals met: 4 of 5
39. (turn_to satellite2 phenomenon5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 77.15 to 74.113, (fuel-used) from 139.67 to 142.707
   goals met: 4 of 5
40. (take_image satellite2 phenomenon5 instrument6 infrared1)
   added: (have_image phenomenon5 infrared1)
   changed: (data_capacity satellite2) from 943 to 845, (data-stored) from 357 to 455
   goals met: 5 of 5
